RA5_DA4_75/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu		nu [0 2 -1 0 0 0 0]	1e-5;

// Thermal expansion coefficient
beta		beta [0 0 0 -1 0 0 0]	1;

// Reference temperature
TRef		TRef [0 0 0 1 0 0 0]	0;

// Laminar Prandtl number
Pr		Pr [0 0 0 0 0 0 0]	0.7;

// ************************************************************************* //
